[
  {
    "author": "Michael V. | Rockville, MD",
    "review": "The gentleman, who I believe he said his name was Justin, was the nicest service provider we have run into in a while. He was very mannerly, worked real hard and did a great job delivering and stacking the split wood. Kudos to Justin and your entire company. It was a pleasure doing business with Kuhn's Tree Service. That is coming from a small service business owner myself."
  },
  {
    "author": "T.N.T. | Rockville, MD",
    "review": "Last week you completed a job at my home in Rockville: removal of dead limbs and hangers from two large oak trees, pruning, vine cutting, and overall cleanup. I just want to say thank you for a job well done. The three gentlemen who worked on the trees were polite, effective, and efficient. They did an outstanding job, and made sure that they cleaned everything up from both the yard and roadway. Appreciate the professionalism."
  },
  {
    "author": "Karla S. | Silver Spring, MD",
    "review": "Kuhn's was immediately responsive to email and phone contact; on-site workers were professional, friendly, and knowledgeable; sales staff did not attempt to oversell; work was completed quickly and professionally; front office provided constant updates on work progress. This is an extremely professional company at all stages that I highly recommend for tree work."
  },
  {
    "author": "Debbie D. | Laurel, MD",
    "review": "To the entire Kuhn's Team, I say, \"Please, Keep doing what you are doing how you're doing it.\" With the daily rains we've been having, I can only imagine how frustrating it has been to deal with continual rescheduling. So please know, speaking from my experience, you couldn't have been more professional, understanding, and accommodating, rescheduling my work as quickly as possible and at the earliest opportunity. And it was well worth the wait. The crew that came to do the work in my yard was AWESOME ! - Truly a team of very skilled, hard-working, considerate gentlemen. The professional job they did removing four trees and elevating the canopy's of three other trees was surpassed only by the inspiring way they worked together as a team, always with an eye on the guy up in the tree while interchangeably cutting up the dropped pieces, hauling them away, and cleaning up the debris. And I would be remiss not to mention Greg's expertise as the arborist and the Kuhn's office staff for their unwavering customer service. I'll recommend Kuhn's Tree Service in a heartbeat. As a matter of fact, I have already given Greg's business card to two neighbors - Hopefully you've heard from them or soon will. A huge THANK-YOU to the entire Kuhn's Team! Most Appreciatively."
  },
  {
    "author": "Philip T. | Rockville, MD",
    "review": "We are completely satisfied with the work performed by Kuhn's Tree Service. The entire project was handled professionally and was completely responsive to our needs. The crew was friendly and helpful. They arrived promptly at the scheduled time, delivered the promised services and did an excellent job of cleaning up when they were finished. I wouldn't hesitate to use them again in the future. In addition, the office staff and estimator handled the estimating, invoicing and scheduling in a very professional manner. I was most impressed by the fact they didn't try to talk us into services that we did not require."
  },
  {
    "author": "Ajay | Chevy Chase, MD",
    "review": "We had a number of trees an arborist recommended we remove due to the health of the trees, and potential hazard, we had received a number of quotes before we contacted Kuhn's, they were excellent, their rates were significantly better, about half the cost of all other bids, they were able to schedule us extremely quickly. The folks came while I was working from the house, checked in with me and went about their business, I hardly knew they were here, until they were knocking on my door letting me know the job was done, and I have to say they did a great job. These will be my go to people if I ever need the service again…don't hesitate if you are looking for a tree removal service, they are great!"
  },
  {
    "author": "Susan | Gaithersburg, MD",
    "review": "Removal of three very tall trees (not sure how tall, but at least 70 ft) I originally contacted Kuhn's to get an estimate for removal of 2 clearly dead trees. When the arborist came to our home, he noticed a very tall red oak that was in the process of dying. Given that it was located beside our garage, he suggested we consider having it removed as well. While he was on our property, he checked for any other dying trees near our house, but didn't find any others. I'll be honest to say that we hemmed and hawed a bit about removing the tree the arborist said was dying. We had another tree company out to give an estimate, and they didn't even notice it or looked at our other trees. We decided in the long run it was better to have that tree removed, which ended up being a really good choice (see below for more details). B/c it's February, we were able to schedule the tree removal for the same week as the estimate. The three-man crew arrived as promised, between 8-9am. The crew verified w/ me what trees needed to be taken down and they went to work. I stayed on the premises all day long. The crew was very professional. They took the time to assess the situation and plan/prep for the removal of each tree. Before taking down the tree the arborist recommended we remove, they let me know that some of the shrubs and a tree underneath it might get some damage from falling limbs. After they took it down, they asked me to come out again. That tree had died in the center and so that affected how it came down. They were concerned that I would be upset by where it landed and they wanted to talk to me about it. The downed tree created only minor damage to a few inconsequential shrubs, I appreciated their concern, and let them know it was OK. After I saw the stump of that tree, I was really glad that we had decided to take that tree down -- it could have created significant damage to our home. An additional crew came to help with clean up. All of the tree debris was removed and our yard and driveway looked good. I would definitely hire Kuhn's Tree Service again."
  },
  {
    "author": "Nicki | Silver Spring, MD",
    "review": "Cut limbs from two large trees, and administered a \"no growth\" solution to keep the trees at their current status. The company is very professional. We obtained three estimates, and although Kuhn's wasn't the lowest, we felt most comfortable that they would do the best job. Two trees need significant trimming; one leaning towards the house. The other was also cut to allow for better satellite reception. The clean-up was excellent. The \"no growth\" solution was added a couple weeks after the tree trimming. We were able to use an Angie's coupon, which helped as well."
  },
  {
    "author": "Andrew | Bowie, MD",
    "review": "Contracted to remove a massive dead tree nestled right between my neighbor's and my house and a fence line. Exceptional service and price!\r\n \r\nVery quick turnaround for an estimate, accepted Angie's list 10% off coupon, quick effective communication, easy to schedule service. The day of service the workers showed up on time, were friendly, safely cut down the tree without damaging anything (the fence was less than 5 feet from the base of the tree, and they still didn't hurt it!), left the firewood as I asked, removed all the brush and debris from the work site.\r\n \r\nADDITIONALLY they removed all the brush from my backyard, which was unbelievable. We thought about asking them to remove the extra brush (we have like 10 trees so brush and leaves are a constant nuisance in my back yard) since they had a chipper, but decided not to ask since they were working so hard at the task at hand. But they did it anyway! And they even chopped the stump down to a remarkably low 3-4 inches from the ground. Every part of this experience warrants praise and continued business. Angie's List readers, you won't go wrong with this company."
  },
  {
    "author": "Jules | Washington, DC",
    "review": "Removal of a dead dogwood tree as well as significant pruning on a yew and two large holly bushes. The crew arrived on time, completed all work to a very good standard, and cleaned the surrounding area well. They were courteous and responsive to small additional instructions from us. (For example trimming one bush to the maximum proper extent in order to allow light into a window.)"
  },
  {
    "author": "Martha | Rockville, MD",
    "review": "Cut down and removed one tree. Trimmed approximately 19 others. Work and clean-up was quick and professional. Left the yard free of any debris from the trees. All work performed as described and expected. They had an emergency - a large tree had fallen on a house - so called the evening before to say they would arrive in the afternoon rather than the morning. A crew of four arrived after one o'clock. Later a fifth person came to help. They stayed until the whole job was complete, about 7PM."
  },
  {
    "author": "Linda | Bethesda, MD ",
    "review": "Removed a few medium size trees. Hauled away the cut materials and cleaned up the work area. No stump grinding was needed due to location of the trees. Overall this was an excellent experience. Everyone I dealt with in this company, whether over the phone, or in person was friendly, professional and efficient. They arrived to give an estimate at the time they said they would, evaluated the work I needed and immediately gave a reasonable estimate. They were able to answer all many questions--they definitely know their business. Upon agreeing that they should do the work, they got back to me right away after reviewing their schedules and set day & time for the work to be performed--very responsive. The work crew arrived at the agreed time and did a great job. They were pleasant. They knew what they were doing. They did it very efficiently and they cleaned up everything at the completion of the job. No surprises in the work performed or the cost. I am very pleased with the services of this company and I would definitely use them again."
  },
  {
    "author": "LR",
    "review": "I had a very pleasant experience with Kuhn's Tree Service from the initial phone call to set up the appointment to the work that was completed on my property. Everyone I spoke with was very pleasant and knowledgeable. The work that was done was flawless. I called back with an additional question concerning something else and they went out of their way to assist me with that small project right away. I will recommend Kuhn's Tree Service to others and will contact them in the future for other services. Thank you everyone!"
  },
  {
    "author": "K. Marshall",
    "review": "Kuhn's Tree Service provided outstanding, professional service at a considerable lower cost than competitors. Additionally, the staff was informative, knowledgeable, responsive and flexible. I'd recommend Kuhn's to anyone seeking professional customer-focused service for a fraction of the cost other competitors charge."
  },
  {
    "author": "Richard & Frances | Silver Spring, MD",
    "review": "Both my wife and I greatly appreciate and are fully satisfied with the work that was performed by Kuhn's Tree Service. The Crew that was dispatched went about their task in an efficient and professional manner showing both consideration and respect to our property and for the health our large (and old) oak tree. Overall, we consider this an extremely positive service experience that was well worth the investment and one that brought considerable value to the dollars that we spent. We have already recommended your firm to our neighbors and expect to be using your services again in the immediate future."
  },
  {
    "author": "J.H. | Silver Spring, MD",
    "review": "I found them on Angie's List. We decided to go with them since their bid was the lowest. The owner of the company came out and did the estimate personally. I happened to be there when he came by and I could speak with him. He described what work they would do and how they would do it and that is what they did. They did a great job. They first removed the trees and then a different crew came around to grind out the stumps. They had two separate crews, with one that cuts the trees and does the removal and then another one that comes out with the machinery to do the stump removal."
  },
  {
    "author": "SC | Bowie, MD",
    "review": "Estimate scheduled. He walked around the property with us to hear our concerns and made recommendations based on his experience; he is knowledgeable. Estimate given. He returned on time to do the work. All work completed as promised for the estimated price and done well. Clean-up done. Excellent job."
  },
  {
    "author": "Cathy | Bethesda, MD ",
    "review": "The snowstorm had broken off a few large branches of a very big pine tree next to our home. We needed the broken branches to be cleaned up and taken away, and other branches on this large tree removed. In addition, we had a few other trees we wanted cut down and a cherry tree that needed pruning. Ken Kuhn came out very quickly and gave us a very competitive estimate. He was extremely knowledgeable about all the trees on our property. We got several estimates for completing the work but I felt that Kuhns was the most knowledgeable and also gave the most competitive estimate. They had an opening so did the work the next day. I was amazed that they were able to do all the work in one day. They cleaned everything up and did a great job. Would use them again."
  },
  {
    "author": "Melo | Silver Spring, MD",
    "review": "Kuhn's Tree Service is a delight to work with. January's ice storm severely damaged a tree on my property and my first thought was to call Kuhn's. They followed through on everything we agreed to. I've used them before and will use them again."
  },
  {
    "author": "Savage | Bethesda, MD",
    "review": "We've used Kuhn's several times for smallish trees on our property. They've always shown up when scheduled, did the work straightforwardly, and cleaned up behind themselves. Their prices are competitive with others so I've stopped getting estimates since I know Kuhn's price will be fair. They have also been generous in leaving us wood chips from our trees, which we appreciate since it's convenient and free."
  },
  {
    "author": "L.R.",
    "review": "Removal of 9 Leyland cyprus trees, plus the roots, (they were as tall as the house). Serious trimming of a tree leaning on the front of the house roof. Light trimming of a talk tree at side of house, and added a cable between branches to hold it together. Cleaned up after the work, refilled holes from trees. Called, and few days later they came out on the weekend to look the trees over and explain about the types of trees we have and where they are best placed on property to have enough space for the type of tree and growth. Discussed pricing and because it was a big job, (I think they said anything over $350 is big) they said they would throw in for free the trimming of the front tree. They came to do the work the day they said they would. The removed the 9 tree's that day, and did the trimming of the front tree. One of them came back separately that afternoon and the following day with a special machine for digging up the roots and then filled most of the holes in. I didn't see them for a few days so I called to ask when they would finish the work. The office manager was very responsive and the remaining work was completed within the next day or so. They did a good clean up after. The payment was due at the end of the project. They accepted the Angie's coupon and gave a discount."
  },
  {
    "author": "M. L. | Bethesda, MD",
    "review": "I used the services of Kuhn's Tree Service Inc. The last time I used their services was during last fall. They took the dead branches that were falling in the yard. I don't remember the price. I got four estimates and they had the best estimate. They were reasonable. They did a terrific job. They came when they said they would. I was very pleased with them. I have had estimates that were at least twice as much of what they ended up being hired for something that's going to be beautiful. They did it very quickly and efficiently."
  },
  {
    "author": "McElwaine | Olney, MD",
    "review": "Once we contacted them, they came out promptly and provided us with a written quote. After we called them back they returned the next day to cut the trees down. They were very professional. The next day, which was a Saturday they had the utility company come out to make sure the stumps weren't near any buried lines. After they received the OK from the utility company they promptly returned to grind down the stumps, again very professional. We did not have to be present for any of this we communicated via phone the whole time."
  },
  {
    "author": "Mrs.Tanouye | Chevy Chase, MD",
    "review": "We had one large tree removed from our backyard and several trees pruned. We were very happy with our experience. The arborist who came out to give us an estimate was very nice and thorough. They had the best price by about $200 and they did a great job with great clean up!"
  },
  {
    "author": "Mrs. Embry | Silver Spring, MD",
    "review": "A tree fell on our two story house during a big storm. Kuhn's came out within 3 hours with a crane to remove the tree. The tree was positioned tenuously on the roof and if not done properly could have caused more damage during the removal. Kuhn's was prompt, careful, thorough and overall did an amazing job on what was not an easy task. Cannot recommend highly enough and this is coming from someone who has had bad luck with contractors in the area."
  },
  {
    "author": "Mr. Towle | Silver Spring, MD",
    "review": "Removed 2 large oak trees, hauled wood, chipped all branches, ground 3 stumps. These guys were great. Not only did they have a good price, they were on time, and were very quick. Only small problem was that they slightly damaged a fence while hauling the wood, but came back the following day to fix."
  },
  {
    "author": "Jocelyn R | Washington, DC",
    "review": "Just to commend you! my parents in Bethesda had recommended Mr. Buchanan to me and we called your service right away. Always greeted politely and efficiently. You were apparently quite busy, but once your team arrived to my house, they cranked the job out so fast it was wonderful. the whole team was very obliging and went above and beyond in cleaning up after themselves and taking more debris than i had initially expected! This was so nice and the man with the chainsaw was very helpful and nice about my \"hovering\" .. ;-) thank you Kuhns! Thank you also to \"Kathy\" (i think) on the phone."
  },
  {
    "author": "Mrs. Liz A | Chevy Chase, MD",
    "review": "The professionalism exhibited by Kuhn's Tree Service at every level was appreciated. Gary, you are a wonderful company representative and arborist. Removing two large oak trees in one day was quite a task. Nelson, Javier, Roberto, Alberto and Milton, thank you for doing such a fabulous job in bringing down the trees so carefully without any damage to the house, patio, and landscaping. I will recommend your company without hesitation! Feel free to add my name to your list of customer references."
  },
  {
    "author": "Paul G | Bethesda, MD ",
    "review": "Prompt. Nice work. Reasonable prices."
  },
  {
    "author": "Elizabeth M | Silver Spring, MD ",
    "review": "During the big snow storm our gate was inaccessible because a huge pine tree had fallen on it and we couldn't get in or out! Kuhn's Tree Service shoveled their way in and climbed over the fence to get to the tree and rescue us! They provided excellent emergency tree service!"
  },
  {
    "author": "Eileena Y | Burtonsville, MD ",
    "review": "I highly recommend Kuhn's Tree Service for any tree and landscaping service. I have lived in Montgomery County for over 45 years, the last 17 years residing in Burtonsville, Maryland. I first called Kuhn's Tree Service for tree and yard work about 14 years ago, and have been using them ever since. Ken Kuhn is an exceptional Arborist, and has correctly eradicated tree diseases and insect infestation I have had over the years, along with treating a variety of other landscaping problems, soil issues, and preforming a variety of landscaping and tree work. He even fortified my vegetable garden with a combination he recommended and delivered - horse manure and wood chips, which made the richest soil I have ever had. I found him, his crews, and the office staff to be courteous and professional in their work. Kuhn's Tree Service has even volunteered their time and materials to helping beautify areas in our community, such as various schools and public space. We should support those businesses who give back to the community, and Kuhn's Tree Service has always been there to help when asked. You can rely on and trust Kuhn's Tree Service. Feel free to contact me directly to verify anything stated or for any further reference. Thank you."
  }
]
